### Ordinal Number Encoding

In [1]:
import datetime

In [2]:
today_date = datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2026, 2, 9, 12, 47, 26, 390409)

In [5]:
today_date-datetime.timedelta(3)

datetime.datetime(2026, 2, 6, 12, 47, 26, 390409)

In [7]:
### List Comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [8]:
import pandas as pd
data = pd.DataFrame(days)

In [9]:
data.columns=['Day']

In [10]:
data.head()

                         Day
0 2026-02-09 12:47:26.390409
1 2026-02-08 12:47:26.390409
2 2026-02-07 12:47:26.390409
3 2026-02-06 12:47:26.390409
4 2026-02-05 12:47:26.390409

In [16]:
data['weekday'] = data['Day'].dt.day_name()

In [17]:
data.head()

                         Day   weekday
0 2026-02-09 12:47:26.390409    Monday
1 2026-02-08 12:47:26.390409    Sunday
2 2026-02-07 12:47:26.390409  Saturday
3 2026-02-06 12:47:26.390409    Friday
4 2026-02-05 12:47:26.390409  Thursday

In [18]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [19]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [20]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [21]:
data

                          Day    weekday  weekday_ordinal
0  2026-02-09 12:47:26.390409     Monday                1
1  2026-02-08 12:47:26.390409     Sunday                7
2  2026-02-07 12:47:26.390409   Saturday                6
3  2026-02-06 12:47:26.390409     Friday                5
4  2026-02-05 12:47:26.390409   Thursday                4
5  2026-02-04 12:47:26.390409  Wednesday                3
6  2026-02-03 12:47:26.390409    Tuesday                2
7  2026-02-02 12:47:26.390409     Monday                1
8  2026-02-01 12:47:26.390409     Sunday                7
9  2026-01-31 12:47:26.390409   Saturday                6
10 2026-01-30 12:47:26.390409     Friday                5
11 2026-01-29 12:47:26.390409   Thursday                4
12 2026-01-28 12:47:26.390409  Wednesday                3
13 2026-01-27 12:47:26.390409    Tuesday                2
14 2026-01-26 12:47:26.390409     Monday                1

#### Count or Frequency Encoding

In [22]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

   0                  1       2           3   4                    5   ...       9     10 11  12              13      14
0  39          State-gov   77516   Bachelors  13        Never-married  ...     Male  2174  0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  13   Married-civ-spouse  ...     Male     0  0  13   United-States   <=50K
2  38            Private  215646     HS-grad   9             Divorced  ...     Male     0  0  40   United-States   <=50K
3  53            Private  234721        11th   7   Married-civ-spouse  ...     Male     0  0  40   United-States   <=50K
4  28            Private  338409   Bachelors  13   Married-civ-spouse  ...   Female     0  0  40            Cuba   <=50K

[5 rows x 15 columns]

In [25]:
columns = [1,3,5,6,7,8,9,13]

In [27]:
train_set=train_set[columns]

In [28]:
train_set

                      1            3                    5   ...      8        9               13
0              State-gov    Bachelors        Never-married  ...   White     Male   United-States
1       Self-emp-not-inc    Bachelors   Married-civ-spouse  ...   White     Male   United-States
2                Private      HS-grad             Divorced  ...   White     Male   United-States
3                Private         11th   Married-civ-spouse  ...   Black     Male   United-States
4                Private    Bachelors   Married-civ-spouse  ...   Black   Female            Cuba
...                  ...          ...                  ...  ...     ...      ...             ...
32556            Private   Assoc-acdm   Married-civ-spouse  ...   White   Female   United-States
32557            Private      HS-grad   Married-civ-spouse  ...   White     Male   United-States
32558            Private      HS-grad              Widowed  ...   White   Female   United-States
32559            Private      HS-grad        Never-married  ...   White     Male   United-States
32560       Self-emp-inc      HS-grad   Married-civ-spouse  ...   White   Female   United-States

[32561 rows x 8 columns]

In [31]:
train_set.columns=['Employment','Degree','Status','Designation','Family_job','Race','Sex','Country']

In [32]:
train_set.head()

          Employment      Degree               Status  ...    Race      Sex         Country
0          State-gov   Bachelors        Never-married  ...   White     Male   United-States
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   United-States
2            Private     HS-grad             Divorced  ...   White     Male   United-States
3            Private        11th   Married-civ-spouse  ...   Black     Male   United-States
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female            Cuba

[5 rows x 8 columns]

In [33]:
for feature in train_set.columns[:]:
    print(feature,":", len(train_set[feature].unique()), 'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [35]:
train_set['Country'].value_counts()

Country
United-States                 29170
Mexico                          643
?                               583
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Cambodia                         19
Trinadad&Tobago                  19
Laos                             18
Thailand                         18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Honduras                         13
Hungary                          13
Scotland                         12
Holand-Netherlands                1
Name: count, dtype: int64

In [36]:
train_set['Country'].value_counts().to_dict()

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Laos': 18,
 ' Thailand': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [37]:
country_map=train_set['Country'].value_counts().to_dict()

In [38]:
train_set['Country'] = train_set['Country'].map(country_map)
train_set.head(20)

C:\Users\kunal\AppData\Local\Temp\ipykernel_15240\2696123196.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_set['Country'] = train_set['Country'].map(country_map)

           Employment         Degree                  Status  ...                 Race      Sex Country
0           State-gov      Bachelors           Never-married  ...                White     Male   29170
1    Self-emp-not-inc      Bachelors      Married-civ-spouse  ...                White     Male   29170
2             Private        HS-grad                Divorced  ...                White     Male   29170
3             Private           11th      Married-civ-spouse  ...                Black     Male   29170
4             Private      Bachelors      Married-civ-spouse  ...                Black   Female      95
5             Private        Masters      Married-civ-spouse  ...                White   Female   29170
6             Private            9th   Married-spouse-absent  ...                Black   Female      81
7    Self-emp-not-inc        HS-grad      Married-civ-spouse  ...                White     Male   29170
8             Private        Masters           Never-married  ...                White   Female   29170
9             Private      Bachelors      Married-civ-spouse  ...                White     Male   29170
10            Private   Some-college      Married-civ-spouse  ...                Black     Male   29170
11          State-gov      Bachelors      Married-civ-spouse  ...   Asian-Pac-Islander     Male     100
12            Private      Bachelors           Never-married  ...                White   Female   29170
13            Private     Assoc-acdm           Never-married  ...                Black     Male   29170
14            Private      Assoc-voc      Married-civ-spouse  ...   Asian-Pac-Islander     Male     583
15            Private        7th-8th      Married-civ-spouse  ...   Amer-Indian-Eskimo     Male     643
16   Self-emp-not-inc        HS-grad           Never-married  ...                White     Male   29170
17            Private        HS-grad           Never-married  ...                White     Male   29170
18            Private           11th      Married-civ-spouse  ...                White     Male   29170
19   Self-emp-not-inc        Masters                Divorced  ...                White   Female   29170

[20 rows x 8 columns]

#### Advantages
1. Easy To Use
2. Not increasing feature space
#### Disadvantages
1. It will provide same weight if the frequencies are same

### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [71]:
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [77]:
df['Cabin']=df['Cabin'].fillna('Missing').astype(str).str[0]

In [78]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [79]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [80]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [84]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [85]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [86]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [87]:
enumerate(ordinal_labels,0)

In [89]:
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [90]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [91]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [92]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [93]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854